text = """
[Куплет 1]  
В истерике кружилась мама Валя  
На заднем фоне замер папа Толя  
В радиусе метра воцарился жесточайший хаос  
Когда всем понятно стало: сын остался без диплома  
Мама, не кричи, хватит плакать, не смей      
Я не спорю — надо, но послушай отец:  
Есть у меня своя волна, и на своей волне  
Меня где-то поджидает успех  

[Предприпев]      
Боже, как хотел я увидеть свет  
И, как посчитал бы нужным жить, мечтал  
И вот однажды, как обычно, я летал во сне  
Вдруг увидел солнце — и тогда себе я сказал:  

[Припев]  
Я выбираю — жить в кайф!    
Я выбираю — жить в кайф!
Я выбираю — жить в кайф!       
Я выбираю — жить в кайф!

[Куплет 2]  
Это был сон, в котором я
Не прогорал, не огорчал родных и не нуждался ни в чём
В котором мне не пришлось скрывать глаза       
И лгать давним знакомым: мол, в жизни моей всё хорошо  
В моём рюкзаке пару маек, носки     
И пускай начало оставляет желать лучшего        
Все, кто меня помнит — знает, я не был таким  
А значит, и у вас получится     

[Предприпев]  
Ведь всё, что я хотел, это видеть свет  
И, как посчитал бы нужным жить, мечтал  
И вот однажды, как обычно, я летал во сне         
Вдруг услышав музыку — я сам себе сказал:  

[Припев]  
Я выбираю — жить в кайф!    
Я выбираю — жить в кайф!  
Я выбираю — жить в кайф!      
Я выбираю — жить в кайф!      

[Предприпев]  
Боже, как хотел я увидеть свет  
И, как посчитал бы нужным жить, мечтал  
И вот однажды, как обычно, я летал во сне             
Вдруг увидел солнце — и тогда себе я сказал:  

[Припев]  
Я выбираю — жить в кайф!  
Я выбираю — жить в кайф!  
Я выбираю — жить в кайф!         
Я выбираю — жить в кайф!
"""


# Your code here 𓆉𓆝 𓆟 𓆞 𓆝 𓆟𓇼
